[
	{"ID":"RZ1001","PRONAME":"Razer Viper V2 Pro","GRANAME":"RZ1001.png","COST":"100.90","MSRP":"189.99","ONHAND":"23","BACKORDER":"2","BRAND":"Razer","DESC":"The Razer Viper has, since its inception, been one of my favourite mice. It has the shape and design that I have always found delivered the esports feel of the Deathadder, with a shape that feels great for long-term use. My current daily driver is the Cyberpunk 2077 Viper, which feels great while gaming or just doing the daily grind of a day at the office"},
	{"ID":"RZ1002","PRONAME":"Razer DeathAdder V2 Pro","GRANAME":"RZ1002.png","COST":"87.34","MSRP":"179.99","ONHAND":"12","BACKORDER":"1","BRAND":"Razer","DESC":"The Razer DeathAdder V2 Pro is an excellent wireless gaming mouse. Its design is nearly identical to the Razer DeathAdder V2, but it now has wireless connectivity, and it can pair to two devices simultaneously for better multitasking. It has a right-handed ergonomic design that makes it very comfortable to use; however, its on the bulky side, so its better suited for medium to large hands. It has a light body and high-quality feet that allow it to glide smoothly. Every button is programmable, its Hypershift feature adds a second layer of programmable inputs, and even the lift-off distance is customizable."},
	{"ID":"RZ1003","PRONAME":"Razer Pro Click Mini","GRANAME":"RZ1003.png","COST":"43.55","MSRP":"99.99","ONHAND":"23","BACKORDER":"5","BRAND":"Razer","DESC":"The Razer Pro Click Mini is an impressive mouse for office use. It feels well-built, and its ambidextrous shape is comfortable to use. You can reprogram nearly all its buttons using the companion software and even assign a Hypershift button for more programmable inputs. It connects wirelessly with a USB receiver or via a Bluetooth connection."},
	{"ID":"RZ1004","PRONAME":"Razer Basilisk V3","GRANAME":"RZ1004.png","COST":"37.89","MSRP":"89.99","ONHAND":"89","BACKORDER":"10","BRAND":"Razer","DESC":"The Razer Basilisk V3 is a continuation of the Razer Basilisk lineup. Its a sleek, full-featured gaming mouse with a solid, matte plastic body, three side buttons on the left, and a right-handed shape with a thumb rest. Its suitable for all grip types and most hand sizes, but small hands may not reach the sniper button comfortably using a claw or fingertip grip. While some older versions of the Basilisk have a scroll wheel with both tactile and free-scrolling modes, this version includes a new software option that can automatically switch between the two modes depending on how quickly you scroll."},
	{"ID":"RZ1005","PRONAME":"Razer DeathAdder Essential","GRANAME":"RZ1005.png","COST":"19.78","MSRP":"39.99","ONHAND":"57","BACKORDER":"3","BRAND":"Razer","DESC":"The Razer DeathAdder Essential retains the classic ergonomic form thats been a hallmark of previous Razer DeathAdder generations. Its sleek and distinct body is designed for comfort and precision, allowing you to maintain high levels of performance throughout long gaming marathons, so youll never falter in the heat of battle."},
	
	{"ID":"LG2001","PRONAME":"G303","GRANAME":"LG2001.png","COST":"68.56","MSRP":"169.99","ONHAND":"59","BACKORDER":"13","BRAND":"Logitech","DESC":"The Logitech G303 Shroud Edition is an upgraded version of the original Logitech G303 Daedalus Apex, and its the product of a collaboration between Logitech and gaming streamer, Shroud. Its a very lightweight, wireless gaming mouse with a diamond-like shaped body, suitable for a claw grip for most hand sizes or a fingertip grip for larger hand sizes. It feels very well-built, and it has smooth-gliding mouse feet. Performance-wise, it has very low click latency, a very low lift-off distance, and a very consistent sensor."},
	{"ID":"LG2002","PRONAME":"G502 HERO","GRANAME":"LG2002.png","COST":"42.36","MSRP":"99.99","ONHAND":"40","BACKORDER":"5","BRAND":"Logitech","DESC":"The Logitech G502 HERO is a wired gaming mouse that feels very well-built. Its right-handed shape offers ergonomic support with a thumb rest, and it has a ton of programmable buttons, including a sniper button. It also has very low click latency and a wide CPI range. Though its rather heavy compared to a dedicated FPS mouse, it comes with five removable weights to allow you to redistribute the weight to suit your preference."},
	{"ID":"LG2003","PRONAME":"Pro X Superlight","GRANAME":"LG2003.png","COST":"24.45","MSRP":"49.99","ONHAND":"79","BACKORDER":"12","BRAND":"Logitech","DESC":"The Logitech G PRO X SUPERLIGHT is an excellent gaming mouse versatile enough for office use. Even though it doesnt have a honeycomb design, its still among the lightest mice weve ever tested, which is especially impressive considering its wireless. It offers amazing performance whether used wired or wirelessly, with a very low click latency and a high polling rate, and its CPI can be customized precisely by increments of 50. Its suitable for all hand sizes with any grip type, although the side buttons may be hard to reach with a fingertip grip if you have small hands."},
	{"ID":"LG2004","PRONAME":"G703","GRANAME":"LG2004.png","COST":"53.67","MSRP":"129.99","ONHAND":"53","BACKORDER":"8","BRAND":"Logitech","DESC":"The Logitech G703 is the best wireless mouse available on the market for medium or above sized right handers. It doesn’t have any shortcomings and features a great shape, lagless wireless and solid buttons with good battery life. The G703 Hero version extends this battery life even further with up to 60 hours of battery life with the RGB off."},
	{"ID":"LG2005","PRONAME":"G903","GRANAME":"LG2005.png","COST":"103.78","MSRP":"199.99","ONHAND":"34","BACKORDER":"6","BRAND":"Logitech","DESC":"The Logitech G903 is an amazing wireless gaming mouse. It has excellent performance, which can be customized in the software. It has a great build quality and has a near-universal shape for all hand sizes and grips. Its latency, whether used wireless or wired, is amazing. Unfortunately, you cant use this wireless mouse via Bluetooth and will need its dedicated receiver to use it wirelessly."},
	
	{"ID":"CR3001","PRONAME":"Scimitar","GRANAME":"CR3001.png","COST":"67.45","MSRP":"119.99","ONHAND":"35","BACKORDER":"6","BRAND":"Corsair","DESC":"The Corsair Scimitar RGB Elite is the third iteration of the Scimitar, after the original and Pro versions. In the attempts of being the best gaming mouse for MOBA/MMO gamers, it features 17 programmable buttons, including a 10-button grid on the left panel. A new PixArt sensor, a higher max CPI of 18,000 and a different mechanism for adjusting macro key positioning that involves a hex key are the primary changes."},
	{"ID":"CR3002","PRONAME":"Nightsword","GRANAME":"CR3002.png","COST":"53.45","MSRP":"99.99","ONHAND":"40","BACKORDER":"5","BRAND":"Corsair","DESC":"The Corsair Nightsword is a comfortable gaming mouse with RGB lighting and an ergonomic design thanks to its slanted shape with a thumb rest. It offers a few programmable buttons, although it isnt on par with a dedicated MMO mouse in that regard. Also, its sensor is quite inconsistent, as it overshoots when moving the mouse fast and undershoots when moving it slow."},
	{"ID":"CR3003","PRONAME":"Dark Core","GRANAME":"CR3003.png","COST":"73.23","MSRP":"129.99","ONHAND":"47","BACKORDER":"11","BRAND":"Corsair","DESC":"The Corsair DARK CORE RGB PRO is an impressive overall wireless gaming mouse. It features an outstanding sensor that can reach a maximum of 18,000 CPI, and you can adjust the CPI in increments of one. It has low click latency and a really high polling rate. Overall this is an amazing mouse for gaming."},
	{"ID":"CR3004","PRONAME":"Katar","GRANAME":"CR3004.png","COST":"23.43","MSRP":"59.99","ONHAND":"80","BACKORDER":"11","BRAND":"Corsair","DESC":"A slightly less expensive, wired riff on last year’s Katar Pro, the $29.99 Katar Pro XT optimizes one of Corsair’s basic gaming mice for the competitive gaming crowd. It’s an incredibly basic design, so its claim to fame is simple and subtle: a chassis with symmetrical sides that tapers dramatically at its base. If you use an alternative grip, this ergonomically unfriendly design will work well for you—but itll prove problematic for everyone else."},
	{"ID":"CR3005","PRONAME":"M65","GRANAME":"CR3005.png","COST":"105.78","MSRP":"169.99","ONHAND":"34","BACKORDER":"6","BRAND":"Corsair","DESC":"The Corsair M65 Elite is a very good gaming mouse that has an excellent build quality thanks to its aluminum frame. Its performance is also outstanding and you can easily customize its CPI settings to better suit your preferences. It also has a sniper button that switches your CPI to your set value for as long as you hold it, which is very useful. On the upside, it has great ergonomics and fits most people."}
]

